In [4]:
# from google.colab import drive
# drive.mount('/content/drive')

In [35]:
import numpy as np
import pandas as pd

# Tokyo Olympics Dataset

In [110]:
# Datasets path
athletes_path = '/content/drive/MyDrive/Colab Notebooks/data/athletes.csv'
coaches_path = '/content/drive/MyDrive/Colab Notebooks/data/coaches.csv'
gender_path = '/content/drive/MyDrive/Colab Notebooks/data/gender.csv'
medals_path = '/content/drive/MyDrive/Colab Notebooks/data/medals.csv'
teams_path = '/content/drive/MyDrive/Colab Notebooks/data/teams.csv'
ranks_path = '/content/drive/MyDrive/Colab Notebooks/data/ranks.csv'
events_path = '/content/drive/MyDrive/Colab Notebooks/data/events.csv'

In [93]:
# Import athletes data
athletes = pd.read_csv(athletes_path)
athletes.head()

                Name Country                Sport
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [94]:
# View number of rows & columns in athletes data
athletes.shape

(5000, 3)

In [95]:
# Import coaches data
coaches = pd.read_csv(coaches_path)
coaches.head()

              Name        Country       Sport Event
0  ABDELMAGID Wael          Egypt    Football   NaN
1        ABE Junya          Japan  Volleyball   NaN
2    ABE Katsuhiko          Japan  Basketball   NaN
3     ADAMA Cherif  C么te d'Ivoire    Football   NaN
4       AGEBA Yuya          Japan  Volleyball   NaN

In [96]:
# Veiw number of rows & columns in coaches data
coaches.shape

(394, 4)

## Inner join
Inner join returns a dataframe with only those rows that have common characteristics. An inner join requires each row in the two joined dataframes to have matching columns values. This is similar to the intersection of two sets.

In [97]:
# Merge athletes data with coaches on sport column
ath_coaches_sport = athletes.merge(coaches, on='Sport')
ath_coaches_sport.head()

           Name_x Country_x  ...    Country_y  Event
0  ABALDE Alberto     Spain  ...        Japan    NaN
1  ABALDE Alberto     Spain  ...        Spain    NaN
2  ABALDE Alberto     Spain  ...  Puerto Rico    NaN
3  ABALDE Alberto     Spain  ...  Puerto Rico  Women
4  ABALDE Alberto     Spain  ...       Serbia    NaN

[5 rows x 6 columns]

In [98]:
# View shape
ath_coaches_sport.shape

(54216, 6)

In [99]:
# Add suffix to the overlapping column names
ath_coaches_sport = athletes.merge(coaches, on='Sport', suffixes=('_athlete', '_coache'))
ath_coaches_sport.head()

     Name_athlete Country_athlete  ... Country_coache  Event
0  ABALDE Alberto           Spain  ...          Japan    NaN
1  ABALDE Alberto           Spain  ...          Spain    NaN
2  ABALDE Alberto           Spain  ...    Puerto Rico    NaN
3  ABALDE Alberto           Spain  ...    Puerto Rico  Women
4  ABALDE Alberto           Spain  ...         Serbia    NaN

[5 rows x 6 columns]

### Types of relationships
- One-to-one
- One-to-many
- Many-to-one 
- Many-to-many

**One-to-one**

In a one-to-one relationship, one record in table is associated with one and only one record in another table. For example, in a school database, each student has only one student ID, and each student ID is assigned to only one person. In other words, every row in one table is related to only one row in other table.

**One-to-many**

In a one-to-many relationship, one record in a table can be associated with one or more records in another table. For example, one **Country** can be in number of **sports** and can participate in different **events**. Lets merge `teams` data with `event` and see how many **countries** participant different **events** of the sport.

In [106]:
# Import teams data
teams = pd.read_csv(teams_path)
teams.head()

      Team           Sport                     Country
0  Belgium  3x3 Basketball                     Belgium
1    China  3x3 Basketball  People's Republic of China
2    China  3x3 Basketball  People's Republic of China
3   France  3x3 Basketball                      France
4    Italy  3x3 Basketball                       Italy

In [107]:
# View number of rows & columns
teams.shape

(743, 3)

In [111]:
# Import event data
events = pd.read_csv(events_path)
events.head()

   Event                     Country
0    Men                     Belgium
1    Men  People's Republic of China
2  Women  People's Republic of China
3  Women                      France
4  Women                       Italy

In [112]:
# View number of rows & columns
events.shape

(743, 2)

In [114]:
# Merge teams data with events on country column
country_events = teams.merge(events, on='Country')
country_events.head()

      Team           Sport  Country                   Event
0  Belgium  3x3 Basketball  Belgium                     Men
1  Belgium  3x3 Basketball  Belgium            Women's Team
2  Belgium  3x3 Basketball  Belgium    4 x 400m Relay Mixed
3  Belgium  3x3 Basketball  Belgium    Men's 4 x 400m Relay
4  Belgium  3x3 Basketball  Belgium  Women's 4 x 400m Relay

In [115]:
# View number of rows & columns
country_events.shape

(17897, 4)

* Notice how `Belgium` is repeating in `Sport` and different `Event` in which the country has the participation.
* Pandas takes care of the one-to-many relationships for us and doesn't require anything special on our end.

## Merge on multiple columns/DataFrames

Merging can also be done on multiple columns as well as multiple dataframes.

Let's merge `athletes` and `coches` data on *Country* and *Sport* columns.

In [118]:
athletes.head()

                Name Country                Sport
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [119]:
coaches.head()

              Name        Country       Sport Event
0  ABDELMAGID Wael          Egypt    Football   NaN
1        ABE Junya          Japan  Volleyball   NaN
2    ABE Katsuhiko          Japan  Basketball   NaN
3     ADAMA Cherif  C么te d'Ivoire    Football   NaN
4       AGEBA Yuya          Japan  Volleyball   NaN

In [120]:
# Merge athletes with coaches on country & sport columns
full_team = athletes.merge(coaches, on=['Country', 'Sport'], suffixes=('_athletes', '_coaches'))
full_team.head()

    Name_athletes Country       Sport                   Name_coaches Event
0  ABALDE Alberto   Spain  Basketball    ALLER CARBALLO Manuel Angel   NaN
1  ABALDE Alberto   Spain  Basketball   DIAZ FERNANDEZ Jenaro Manuel   NaN
2  ABALDE Alberto   Spain  Basketball          GONZALEZ JARENO Angel   NaN
3  ABALDE Alberto   Spain  Basketball  HERNANDEZ FRAILE Jose Ignacio   NaN
4  ABALDE Alberto   Spain  Basketball            LAZARO CORRAL Jesus   NaN

Let's do multiple merging on `athletes`, `coaches`, and `medals` dataframes.

In [121]:
# Import medals data
medals = pd.read_csv(medals_path)
medals.head()

   Rank by Gold_Medals                     Country  ...  Total  Rank by Total_Medals
0                    1    United States of America  ...    113                     1
1                    2  People's Republic of China  ...     88                     2
2                    3                       Japan  ...     58                     5
3                    4               Great Britain  ...     65                     4
4                    5                         ROC  ...     71                     3

[5 rows x 7 columns]

In [122]:
# View rows & columns
medals.shape

(93, 7)

In [123]:
# Merge athletes, coaches on country & sport columns
# Also merge medals on country columns
team_medal_ranks = athletes.merge(coaches, on=['Country', 'Sport'], suffixes=('_athlethes', '_coaches'))\
                                  .merge(medals, on='Country')
team_medal_ranks.head()

   Name_athlethes Country       Sport  ... Bronze Total  Rank by Total_Medals
0  ABALDE Alberto   Spain  Basketball  ...      6    17                    17
1  ABALDE Alberto   Spain  Basketball  ...      6    17                    17
2  ABALDE Alberto   Spain  Basketball  ...      6    17                    17
3  ABALDE Alberto   Spain  Basketball  ...      6    17                    17
4  ABALDE Alberto   Spain  Basketball  ...      6    17                    17

[5 rows x 11 columns]

In [124]:
# View rows & columns
team_medal_ranks.shape

(3274, 11)

## Left join

Left join returns all the rows of the table on the left side of the join and matchine rows for the table on the right side of join.

The rows for which there is no matching row on right side, the result-set will contain null. Left join is also known as left outer join.

Let's do the left join on the `athletes` dataframe with `gender` dataframe.

In [125]:
# Import gender data
gender = pd.read_csv(gender_path)
gender.head()

                 Sport  Female  Male  Total
0       3x3 Basketball      32    32     64
1              Archery      64    64    128
2  Artistic Gymnastics      98    98    196
3    Artistic Swimming     105     0    105
4            Athletics     969  1072   2041

In [126]:
# View number of rows & columns
gender.shape

(46, 4)

In [128]:
athletes.head()

                Name Country                Sport
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [132]:
# Left join of athletes with gender on sport column
left_ath_gender = athletes.merge(gender, on='Sport', how='left')
left_ath_gender.head()

                Name Country                Sport  Female  Male  Total
0    AALERUD Katrine  Norway         Cycling Road      70   131    201
1        ABAD Nestor   Spain  Artistic Gymnastics      98    98    196
2  ABAGNALE Giovanni   Italy               Rowing     257   265    522
3     ABALDE Alberto   Spain           Basketball     144   144    288
4      ABALDE Tamara   Spain           Basketball     144   144    288

In [133]:
# View data
left_ath_gender.shape

(5000, 6)

## Right join

Right join return all rows from the right side, and any rows with mathcing keys from the left table.

In [135]:
# Do the same merge as above but with right join
right_ath_gender = athletes.merge(gender, on='Sport', how='right')
right_ath_gender.head()

                 Name      Country           Sport  Female  Male  Total
0  BAYASGALAN Solongo     Mongolia  3x3 Basketball      32    32     64
1      BEKKERING Ross  Netherlands  3x3 Basketball      32    32     64
2     BOGAERTS Rafael      Belgium  3x3 Basketball      32    32     64
3           BROWN Ira        Japan  3x3 Basketball      32    32     64
4        CAVARS Agnis       Latvia  3x3 Basketball      32    32     64

In [139]:
# View rows & columns
right_ath_gender.shape

(5000, 6)

## Outer join

Outer join returns all rows from both tables, join records from the left which have matching keys in the right table. when there is no matching from any table NaN will be returned.

In [137]:
# Outer join on same dataframes
outer_ath_gender = athletes.merge(gender, on='Sport', how='outer')
outer_ath_gender.head()

               Name               Country         Sport  Female  Male  Total
0   AALERUD Katrine                Norway  Cycling Road      70   131    201
1  ALI ZADA Masomah  Refugee Olympic Team  Cycling Road      70   131    201
2      ALMEIDA Joao              Portugal  Cycling Road      70   131    201
3     AMADOR Andrey            Costa Rica  Cycling Road      70   131    201
4        AMHA Selam              Ethiopia  Cycling Road      70   131    201

In [138]:
# View rows & columns
outer_ath_gender.shape

(5000, 6)